//&        Оператор && приводить всі операнди до буля і повертає значення одного з них. Лівий операнд - якщо його можна привести до false, і правий - в інших випадках.

//!     логічне «І» (&&) зупиняється на хибному і повертає те, на чому зупинилось, або останній операнд.

// false && true -> false
// false && false -> false
// true && true -> true
// true && false -> false

// const age = 20;
// console.log(age > 10 && age < 30);

//&      Оператор || приводить всі операнди до буля і повертає значення одного з них. Лівий операнд - якщо його можна привести до true, і правий - в інших випадках.

//!  логічне «АБО» (||) зупиняється на правді і повертає те, на чому зупинилося або останній операнд.

// false || true -> true
// false || false -> false
// true || true -> true
// true || false -> true

//&    ! Всі оператори, які ми розглядали до цього, були бінарними - містять два операнди: лівий і правий. Логічне «НЕ» - це унарний оператор, який виконує операцію над одним операндом з правої сторони.

// хибні значення які приводяться до false
//!!!!!           0, NaN, null, undefined, false, "" ;

const num = 5;
const result = num < 10 || num > 30;
// console.log(result); //true

//!     логічне «І» (&&) зупиняється на хибному і повертає те, на чому зупинилось, або останній операнд.
//!  логічне «АБО» (||) зупиняється на правді і повертає те, на чому зупинилося або останній операнд.

// console.log("" && 8);
// console.log(!' ' && !'sdf');

// console.log(!true);

// =========================Оператори розгалуження================================

// ===================================== if ======================================
// if(умова){
//     // тіло інструкції
// }

const age = 118;

let msg = "Привіт! Ти ще маленький)))";

if (age >= 18) {
  msg = "Привіт! Ти повнолітній";
}

// console.log(msg);

// ============================= if else ===================================
// if (умова) {
//     // тіло інструкції
// } else {
//      // тіло інструкції
// }

let msg1 = "";

if (age >= 18) {
  msg1 = "Привіт! Ти повнолітній";
} else {
  msg1 = "Привіт! Ти ще маленький)))";
}
// console.log(msg1);

// ============================= else if ===================================

// if (умова) {

// } else if (умова) {

// }else if (умова) {

// }else if (умова) {
// }
// if(){} else if(){} else if(){}

const age1 = 18;

if (age1 >= 18) {
  //   console.log("Повнолітні!");
} else if (age1 >= 16 || age < 18) {
  //   console.log("Підліток");
} else if (age1 < 16) {
  //   console.log("Малолітній!");
}

// ============================ Тернарний оператор =============================
// <умова> ? <вираз_якщо_умова_правдива> : <вираз_якщо_умова_хибна>
//  () ? <> :<>

const age3 = 18;

const isAdult = age3 >= 18 ? "Повнолітній!" : "Дитина!";

// console.log(isAdult);

// ====================================================

const salary = 3001;

if (salary >= 1000 && salary < 2000) {
   console.log('зарплата :>> Рівень 1 '); 
} else if (salary >= 2000 && salary < 3000){
    console.log('зарплата :>> Рівень 2 '); 
} else if(salary > 3000 ){
    console.log('зарплата :>> Рівень 3 '); 

} else {
    console.log('Працюй більше!!!! '); 
} 
